import Button from "../components/button/Button"
import FAQItem from "../components/questions/Questions"
import styles from "./ForthScreen.module.css"


const ForthScreen = () => {
  return (
    <>
      <div className={styles.title}>אתן שואלות ואני עונה</div>
      
      {/* שאלות טכניות */}
      <FAQItem 
        question="מה אם אני לא מבינה בטכנולוגיה בכלל.. אני אסתדר עם הקורס הדיגיטלי?" 
        answer="הקורס בנוי בצורה הכי ברורה שיש! כל שלב מוסבר בפשטות ובבהירות, בנוס, אני והצוות שלי כאן לעזור בכל שאלה שעולה לך, כל מה דאת צריכה זה לדעת איך להדליק מחשב - את כל השאר נלמד יחד!" 
      />
      

   
  <FAQItem 
        question="אני לא מסתדרת עם הדיגיטל, אפשר להגיע ללמוד פרונטלית?" 
        answer="כן, יש אופציה להגיע ללמוד גם פרונטלית, צרי קשר עם האקדמיה או איתי בפרטי ויפנו אלייך עם כל הפרטים" 
      />
    
      
      <FAQItem 
        question="זה לא רק לצעירות? אני כבר לא בת 20..." 
        answer="בדיוק להפך! הניסיון והחוכמה שלך הם היתרון הכי גדול שלך. יש לנו גם תלמידות בנות 50+ באקדמיה - אף פעם לא מאוחר מדי!" 
      />
      

      {/* שאלות על חששות ופחדים */}
      <FAQItem 
        question="אני מפחדת שאני באמת לא מספיק טובה כדי להצליח" 
        answer="אף אחת לא נולדה מאסטרית! כל המצליחות התחילו בדיוק כמוך - עם פחדים וספקות. המפתח הוא לקחת את הצעד הראשון למרות החששות ולא לוותר. אני כאן ללוות אותך בכל דרך!" 
      />
      
   <Button text="רחלי, קחי אותי לקורס!"/>
      

    </>
  )
}

export default ForthScreen