import Button from "../components/button/Button"
import FAQItem from "../components/questions/Questions"
import styles from "./ForthScreen.module.css"


const ForthScreen = () => {
  return (
    <>
      <div className={styles.title}>אתן שואלות ואני עונה</div>
      
      {/* שאלות על הלמידה הדיגיטלית */}
      <FAQItem 
        question="מה אם אני לא מבינה בטכנולוגיה בכלל.. אני אסתדר עם הקורס הדיגיטלי?" 
        answer="תשכחי מהטכנולוגיה! הקורס שלי בנוי כל כך בפשטות שאת צריכה רק לדעת איך להדליק מחשב. כל שלב מצולם בבהירות מושלמת, עם הסברים מילה במילה כמו שהיית יושבת לידי בסטודיו. בנוסף, אני והצוות כאן בשבילך לכל שאלה - אף בחורה לא נשארת לבד!" 
      />
      

      <FAQItem 
        question="מה אם יש לי שאלות באמצע הקורס? מי יעזור לי?" 
        answer="אני והצוות תמיד כאן! כל מי שרוכשת את הקורס הדיגיטלי הופכת להיות חלק מהמשפחה. לכל שאלה את יכולה לפנות אלינו ותקבלי את המענה עד שהכל יהיה ברור, את אפילו להגיע לאקדמיה להתאמן על מודליסטיות במידה ומשהו לא יושב אצלך מספיק טוב" 
      />

      <FAQItem 
        question="למדתי מיקרו בעבר ולא הצלחתי, למה שהפעם יהיה שונה?" 
        answer=" אני מבינה את החשש מלהכשל שוב - הייתי שם! חשוב לי שתדעי שמאות בנות שעברו אצלי, הגיעו אחרי שהן עברו קורסים כושלים בעבר - והיום הן עובדות בביטחון מלא. השיטה שלי RL היא לא עוד טכניקה, היא מונעת טעויות מהבסיס. אני לא מלמדת אותך 'עוד דרך' - אני עושה לך סדר מלא מאפס. פה את לומדת את הכל לעומק, עם 6 טיפולים מצולמים במלואם ו50 שעות יחד איתי ועם החומר, מה שיקבע אם הפעם זה יהיה שונה זו את, ההתמדה שלך, התרגול והגישה שתגיעי איתה" 
      />


      <FAQItem 
        question="אני מפחדת שאני באמת לא מספיק טובה כדי להצליח" 
        answer="יקירה, אני הייתי בדיוק במקום שלך! סיימתי קורס ועזבתי את התחום כי לא היה לי בטחון והייתי בטוחה שאני לא אחזיק את המחט לעולם יותר. אבל הבנתי משהו - אף אחת לא נולדה מאסטרית. הטכניקה שלי RL נבנתה בדיוק בשביל בנות כמוך - בנות שרוצות לעבוד בביטחון מלא למרות שהוא לא קיים ב100% עכשיו. עם השיטה שלי אני בטוחה שהבטחון שלך יחזור ותוכלי להתחיל לעבוד במקצועיות עם חיוך ולהפוך את התשוקה שלך לקריירה אמיתית!" 
      />



      <Button text="רחלי, קחי אותי לקורס!"/>
      

    </>
  )
}

export default ForthScreen